/*	Найти корни квадратного(или биквадратного) уравнения.*/

package alevel.lesson1.homework;

public class Exercise1 {

//1.	Ввести уравнение;
//2.	Если уравнение биквадратное
//  2.1.	Сделать замену квадрата аргумента на новую переменную;
//3.	Найти дискриминант уравнения;
//4.	Если дискриминант отрицательный
//  4.1.	Взять модуль дискриминанта и умножить на i2; 	// I = √-1
//5.	Найти корни уравнения;
//6.	Если исходное уравнение биквадратное
//  6.1.	Если корень(и) полученного в п. 2.1 уравнения меньше 0
//      6.1.1.	 Взять их модуль(и) и умножить на i2;
//  6.2.	Произвести обратную замену аргументов;
//  6.3.	Из полученных результатов взять квадратный корень;
//  6.4.	Если корни полученные в п. 5 мнимые
//      6.4.1.	 Заменить  √i на 0.71(1+i);
//7.	Продолжить?;
//8.	Если «да»
//  8.1.	Возвращаемся к п.1;
//9.	Иначе
//  9.1.	Закончить программу;

}
