/*Задан текст, подлежащий шифрованию и слово-ключ. Зашифровать текст методом подст*/


package alevel.lesson1.homework;

public class Exercise3 {

//1.	Присваиваем каждой букве алфавита и знакам препинания номер;
//2.	Присваиваем каждому символу ключа номер;
//3.	Берем первый символ исходного текста;
//  4.1	Берем номер такого же символа из массива, введенного в п.1;
//  4.2	Находим символ с этим номером в массиве, введенном во втором пункте;
//  4.3	Записываем полученный символ в зашифрованный текст[];
//  4.4	Если символ исходного текста был последним
//      4.4.1	Переходим к пункту 5;
//  4.5	Иначе – берем следующий символ;
//  4.6	Переходим к пункту 4.1;
//5.	Выводим зашифрованный текст;
//6.	Закончить программу;


}
