/*Заданы плоские декартовы координаты треугольника. Найти площадь треугольника.*/


package alevel.lesson1.homework;

public class Exercise2 {

//1.	Ввести заданные координаты точек;
//2.	Исходя из заданных координат, решить пример	    // здесь нужно бы построить матрицу 2го
//    (x1 - x3)(y2 - y3) – (y1 - y3) (x2 - x3);			// порядка и найти ее определитель,
//                                                      // но только людям, Скайнет и без нее обойдется
//3.	Т.к. площадь величина положительная, взять модуль числа полученного в п.2;
//4.	Поделить результат на 2;
//5.	Вывести полученное значение ;
//6.	Закончить программу;


}
